In [1]:
import pandas as pd

file_to_load = "purchase_data.csv"

purchase_data = pd.read_csv(file_to_load)

In [2]:
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [3]:
purchase_data.describe()

       Purchase ID         Age     Item ID       Price
count   780.000000  780.000000  780.000000  780.000000
mean    389.500000   22.714103   92.114103    3.050987
std     225.310896    6.659444   52.775943    1.169549
min       0.000000    7.000000    0.000000    1.000000
25%     194.750000   20.000000   48.000000    1.980000
50%     389.500000   22.000000   93.000000    3.150000
75%     584.250000   25.000000  139.000000    4.080000
max     779.000000   45.000000  183.000000    4.990000

In [4]:
#Total Players
total = len(purchase_data["SN"].value_counts())
total

player_number = pd.DataFrame({"Total Players":[total]})
player_number

   Total Players
0            576

In [5]:
#Unique Items
number_of_unique_items = len(purchase_data["Item ID"].unique())
number_of_unique_items

183

In [6]:
#Average Price
average_price = purchase_data["Price"].mean()
purchase_data.round(2)
average_price

3.050987179487176

In [7]:
#Number of purchases
number_of_purchases = purchase_data["Purchase ID"].count()
number_of_purchases

780

In [8]:
#Total Revenue
total_revenue = purchase_data["Price"].sum()
total_revenue

2379.77

In [9]:
#Summary Table
summary_table_df = pd.DataFrame({"Number of Unique Items":[number_of_unique_items],
                                 "Average Price":[average_price],
                                 "Number of Purchases":[number_of_purchases],
                                 "Total Revenue":[total_revenue]})
summary_table_df.round(2)

   Number of Unique Items  Average Price  Number of Purchases  Total Revenue
0                     183           3.05                  780        2379.77

In [10]:
#Gender Statistics
gender_count = purchase_data.groupby("Gender")["SN"].nunique()

gender_count

Gender
Female                    81
Male                     484
Other / Non-Disclosed     11
Name: SN, dtype: int64

In [11]:
gender_percentage = gender_count/total*100

gender_percentage.round(2)

Gender
Female                   14.06
Male                     84.03
Other / Non-Disclosed     1.91
Name: SN, dtype: float64

In [12]:
gender = [(84.03, 484),
         (14.06, 81),
         (1.91, 11)]
gender_summary = pd.DataFrame(gender, columns =["Percentage of Players","Total Count"],index = ["Male", "Female", "Other/Non_Disclosed"])

gender_summary

                     Percentage of Players  Total Count
Male                                 84.03          484
Female                               14.06           81
Other/Non_Disclosed                   1.91           11

In [13]:
gender_purchases = purchase_data.groupby("Gender")["Item Name"]

gender_purchases.count()

Gender
Female                   113
Male                     652
Other / Non-Disclosed     15
Name: Item Name, dtype: int64

In [14]:
gender_average = purchase_data.groupby("Gender")["Price"].mean()
gender_average.round(2)

Gender
Female                   3.20
Male                     3.02
Other / Non-Disclosed    3.35
Name: Price, dtype: float64

In [15]:
gender_total_purchase = purchase_data.groupby("Gender")["Price"].sum()
gender_total_purchase

Gender
Female                    361.94
Male                     1967.64
Other / Non-Disclosed      50.19
Name: Price, dtype: float64

In [16]:
gender_purchase_average = gender_total_purchase/gender_count
gender_purchase_average.round(2)

Gender
Female                   4.47
Male                     4.07
Other / Non-Disclosed    4.56
dtype: float64

In [17]:
gender_stats = [(113, 3.20, 361.94, 4.47),
                     (652, 3.02, 1967.64, 4.07),
                     (15, 3.35, 50.19, 4.56)]

gender_summary_table = pd.DataFrame(gender_stats, columns =["Purchase Count","Average Purchase Price", "Total Purchase Value", "Average Total Purchase Per Person"],
                                    index = ["Male", "Female", "Other/Non_Disclosed"])
gender_summary_table

,Purchase Count,Average Purchase Price,Total Purchase Value,Average Total Purchase Per Person
Male,113,3.20,361.94,4.47
Female,652,3.02,1967.64,4.07
Other/Non_Disclosed,15,3.35,50.19,4.56

In [18]:
#Create Bins for Ages

bins = [0, 10, 15, 20, 25, 30, 35, 40, 45]

age_ranges = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"]

In [19]:
purchase_data["Age Summary"] = pd.cut(purchase_data["Age"], bins, labels=age_ranges, include_lowest=True)
purchase_data

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Summary
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,15-19
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,35-39
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24
...,...,...,...,...,...,...,...,...
775,775,Aethedru70,21,Female,60,Wolf,3.54,20-24
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63,20-24
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46,15-19
778,778,Sisur91,7,Male,101,Final Critic,4.19,<10
779,779,Ennrian78,24,Male,50,Dawn,4.60,20-24

In [20]:
bin_age = (purchase_data["Age Summary"].value_counts())
bin_age

20-24    325
15-19    200
25-29     77
10-14     54
30-34     52
35-39     33
<10       32
40+        7
Name: Age Summary, dtype: int64

In [21]:
age_percentage = bin_age/576
age_percentage

20-24    0.564236
15-19    0.347222
25-29    0.133681
10-14    0.093750
30-34    0.090278
35-39    0.057292
<10      0.055556
40+      0.012153
Name: Age Summary, dtype: float64

In [22]:
age_ranges = pd.DataFrame({"Ages Total Count":bin_age,
                          "Percentage of Players":age_percentage})
age_ranges

       Ages Total Count  Percentage of Players
20-24               325               0.564236
15-19               200               0.347222
25-29                77               0.133681
10-14                54               0.093750
30-34                52               0.090278
35-39                33               0.057292
<10                  32               0.055556
40+                   7               0.012153

In [23]:
#Purchase Count by age
age_count = purchase_data.groupby("Age")["Price"]

age_count.count()

Age
7      9
8      8
9      6
10     9
11     7
12     6
13     4
14     2
15    35
16    30
17    22
18    26
19    23
20    99
21    62
22    70
23    67
24    67
25    59
26    14
27    10
28     5
29    13
30    35
31     7
32     8
33    14
34     9
35    14
36     5
37     7
38     9
39     6
40     6
41     2
42     1
43     1
44     2
45     1
Name: Price, dtype: int64

In [24]:
#Average purchase data by age
age_average = purchase_data.groupby("Age")["Price"].mean()
age_average.round(2)

Age
7     3.65
8     3.25
9     3.04
10    3.54
11    2.68
12    2.63
13    2.36
14    3.46
15    3.02
16    3.02
17    2.93
18    3.16
19    3.04
20    3.17
21    2.92
22    2.96
23    3.01
24    3.14
25    3.08
26    2.87
27    2.72
28    1.69
29    2.71
30    3.15
31    3.44
32    2.84
33    2.49
34    2.46
35    3.72
36    2.53
37    3.64
38    3.79
39    3.89
40    2.78
41    3.27
42    3.93
43    4.00
44    2.68
45    1.70
Name: Price, dtype: float64

In [25]:
#Total purchases by age
age_total = purchase_data.groupby("Age")["Price"].sum()
age_total

Age
7      32.89
8      25.97
9      18.27
10     31.83
11     18.79
12     15.80
13      9.45
14      6.91
15    105.65
16     90.56
17     64.48
18     82.22
19     69.98
20    314.32
21    180.74
22    206.85
23    201.93
24    210.22
25    181.90
26     40.19
27     27.23
28      8.45
29     35.23
30    110.32
31     24.05
32     22.69
33     34.81
34     22.13
35     52.03
36     12.66
37     25.51
38     34.15
39     23.32
40     16.71
41      6.54
42      3.93
43      4.00
44      5.36
45      1.70
Name: Price, dtype: float64

In [26]:
#Average Total purchase per person by age
average_total_purchase_age = age_total/576
average_total_purchase_age

Age
7     0.057101
8     0.045087
9     0.031719
10    0.055260
11    0.032622
12    0.027431
13    0.016406
14    0.011997
15    0.183420
16    0.157222
17    0.111944
18    0.142743
19    0.121493
20    0.545694
21    0.313785
22    0.359115
23    0.350573
24    0.364965
25    0.315799
26    0.069774
27    0.047274
28    0.014670
29    0.061163
30    0.191528
31    0.041753
32    0.039392
33    0.060434
34    0.038420
35    0.090330
36    0.021979
37    0.044288
38    0.059288
39    0.040486
40    0.029010
41    0.011354
42    0.006823
43    0.006944
44    0.009306
45    0.002951
Name: Price, dtype: float64

In [27]:
#Age DataFrame

age_ranges = pd.DataFrame({"Purchase Count":age_count,
                   "Average Purchase Price":age_average,
                   "Total Purchase Value":age_total,
                   "Avg Total Purchase per Person":average_total_purchase_age})

age_ranges

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Age,,,,
7,"(7, [3.09, 2.38, 4.6, 4.32, 4.48, 2.52, 3.08, ...",3.654444,32.89,0.057101
8,"(8, [2.05, 3.47, 3.65, 4.09, 1.61, 1.29, 4.93,...",3.246250,25.97,0.045087
9,"(9, [2.05, 3.08, 3.39, 2.85, 4.4, 2.5])",3.045000,18.27,0.031719
10,"(10, [4.09, 4.18, 4.35, 3.54, 2.89, 4.19, 1.75...",3.536667,31.83,0.055260
11,"(11, [1.61, 4.24, 1.63, 1.79, 1.97, 3.36, 4.19])",2.684286,18.79,0.032622
12,"(12, [3.53, 3.54, 2.05, 1.97, 1.56, 3.15])",2.633333,15.80,0.027431
13,"(13, [3.75, 2.45, 1.03, 2.22])",2.362500,9.45,0.016406
14,"(14, [1.97, 4.94])",3.455000,6.91,0.011997
15,"(15, [3.3, 2.94, 4.43, 2.48, 1.09, 4.74, 2.52,...",3.018571,105.65,0.183420
16,"(16, [4.4, 2.92, 3.47, 2.28, 4.66, 1.28, 2.5, ...",3.018667,90.56,0.157222
17,"(17, [4.23, 1.76, 1.28, 1.66, 4.35, 4.8, 1.75,...",2.930909,64.48,0.111944
18,"(18, [3.77, 1.63, 2.18, 4.09, 3.53, 3.75, 3.81...",3.162308,82.22,0.142743
19,"(19, [2.94, 4.4, 3.03, 3.09, 1.75, 4.18, 4.6, ...",3.042609,69.98,0.121493
20,"(20, [3.53, 2.67, 2.52, 4.6, 1.48, 1.56, 1.33,...",3.174949,314.32,0.545694
21,"(21, [4.18, 2.89, 1.76, 4.32, 3.14, 2.18, 3.39...",2.915161,180.74,0.313785
22,"(22, [3.61, 1.1, 1.7, 4.9, 2.05, 2.96, 1.7, 3....",2.955000,206.85,0.359115
23,"(23, [1.44, 4.74, 2.67, 1.66, 1.74, 4.86, 3.19...",3.013881,201.93,0.350573
24,"(24, [4.88, 3.27, 3.16, 4.18, 2.73, 3.16, 4.76...",3.137612,210.22,0.364965
25,"(25, [3.79, 2.22, 4.23, 4.64, 1.02, 4.94, 3.81...",3.083051,181.90,0.315799
26,"(26, [2.96, 4.94, 4.48, 1.75, 3.45, 3.94, 2.42...",2.870714,40.19,0.069774
27,"(27, [3.44, 1.79, 3.61, 1.98, 1.87, 4.64, 3.1,...",2.723000,27.23,0.047274
28,"(28, [1.41, 1.14, 1.14, 2.48, 2.28])",1.690000,8.45,0.014670
29,"(29, [4.23, 1.56, 2.48, 4.9, 2.61, 2.42, 3.07,...",2.710000,35.23,0.061163
30,"(30, [4.64, 3.19, 3.15, 4.23, 4.9, 1.02, 4.4, ...",3.152000,110.32,0.191528
31,"(31, [4.89, 2.48, 3.82, 4.58, 1.76, 3.58, 2.94])",3.435714,24.05,0.041753
32,"(32, [2.84, 1.16, 3.58, 2.27, 3.39, 4.0, 3.4, ...",2.836250,22.69,0.039392
33,"(33, [1.44, 1.29, 1.54, 3.58, 2.49, 1.94, 2.17...",2.486429,34.81,0.060434
34,"(34, [2.38, 3.27, 1.29, 2.05, 2.89, 3.65, 3.09...",2.458889,22.13,0.038420
35,"(35, [3.58, 4.86, 4.48, 3.81, 2.73, 4.32, 4.82...",3.716429,52.03,0.090330
36,"(36, [2.18, 1.71, 2.94, 1.6, 4.23])",2.532000,12.66,0.021979
37,"(37, [4.48, 3.44, 4.9, 3.03, 1.79, 4.6, 3.27])",3.644286,25.51,0.044288
38,"(38, [3.81, 4.4, 4.35, 1.75, 2.62, 4.35, 4.89,...",3.794444,34.15,0.059288
39,"(39, [4.07, 4.88, 3.45, 4.91, 2.85, 3.16])",3.886667,23.32,0.040486
40,"(40, [1.56, 3.4, 1.79, 1.33, 4.23, 4.4])",2.785000,16.71,0.029010
41,"(41, [1.61, 4.93])",3.270000,6.54,0.011354
42,"(42, [3.93])",3.930000,3.93,0.006823
43,"(43, [4.0])",4.000000,4.00,0.006944
44,"(44, [3.39, 1.97])",2.680000,5.36,0.009306
45,"(45, [1.7])",1.700000,1.70,0.002951

In [28]:
#Top Spenders
purchase_total = purchase_data.groupby("SN")["Price"].count()
purchase_total

SN
Adairialis76     1
Adastirin33      1
Aeda94           1
Aela59           1
Aelaria33        1
                ..
Yathecal82       3
Yathedeu43       2
Yoishirrala98    1
Zhisrisu83       2
Zontibe81        3
Name: Price, Length: 576, dtype: int64

In [29]:
average_purchase = purchase_data.groupby("SN")["Price"].mean()
average_purchase

SN
Adairialis76     2.280000
Adastirin33      4.480000
Aeda94           4.910000
Aela59           4.320000
Aelaria33        1.790000
                   ...
Yathecal82       2.073333
Yathedeu43       3.010000
Yoishirrala98    4.580000
Zhisrisu83       3.945000
Zontibe81        2.676667
Name: Price, Length: 576, dtype: float64

In [30]:
total_purchase = purchase_data.groupby("SN")["Price"].sum()
total_purchase

SN
Adairialis76     2.28
Adastirin33      4.48
Aeda94           4.91
Aela59           4.32
Aelaria33        1.79
                 ...
Yathecal82       6.22
Yathedeu43       6.02
Yoishirrala98    4.58
Zhisrisu83       7.89
Zontibe81        8.03
Name: Price, Length: 576, dtype: float64

In [31]:
purchase_total = pd.DataFrame({"Purchase Count":purchase_total,
                              "Average Purchase Price":average_purchase,
                              "Total Purchase Value":total_purchase})
purchase_total

               Purchase Count  Average Purchase Price  Total Purchase Value
SN
Adairialis76                1                2.280000                  2.28
Adastirin33                 1                4.480000                  4.48
Aeda94                      1                4.910000                  4.91
Aela59                      1                4.320000                  4.32
Aelaria33                   1                1.790000                  1.79
...                       ...                     ...                   ...
Yathecal82                  3                2.073333                  6.22
Yathedeu43                  2                3.010000                  6.02
Yoishirrala98               1                4.580000                  4.58
Zhisrisu83                  2                3.945000                  7.89
Zontibe81                   3                2.676667                  8.03

[576 rows x 3 columns]

In [32]:
#Item purchase count
item_count = purchase_data.groupby(["Item ID", "Item Name"])["Price"].count()
item_count

Item ID  Item Name
0        Splinter                           4
1        Crucifer                           3
2        Verdict                            6
3        Phantomlight                       6
4        Bloodlord's Fetish                 5
                                           ..
179      Wolf, Promise of the Moonwalker    6
180      Stormcaller                        1
181      Reaper's Toll                      5
182      Toothpick                          3
183      Dragon's Greatsword                3
Name: Price, Length: 183, dtype: int64

In [33]:
#Item price
item_price = purchase_data.groupby(["Item ID", "Item Name"])["Price"].mean()
item_price

Item ID  Item Name
0        Splinter                           1.28
1        Crucifer                           3.26
2        Verdict                            2.48
3        Phantomlight                       2.49
4        Bloodlord's Fetish                 1.70
                                            ...
179      Wolf, Promise of the Moonwalker    4.48
180      Stormcaller                        3.36
181      Reaper's Toll                      1.66
182      Toothpick                          4.03
183      Dragon's Greatsword                1.09
Name: Price, Length: 183, dtype: float64

In [34]:
#Total item price
item_total = purchase_data.groupby(["Item ID", "Item Name"])["Price"].sum()
item_total

Item ID  Item Name
0        Splinter                            5.12
1        Crucifer                            9.78
2        Verdict                            14.88
3        Phantomlight                       14.94
4        Bloodlord's Fetish                  8.50
                                            ...
179      Wolf, Promise of the Moonwalker    26.88
180      Stormcaller                         3.36
181      Reaper's Toll                       8.30
182      Toothpick                          12.09
183      Dragon's Greatsword                 3.27
Name: Price, Length: 183, dtype: float64

In [35]:
items = pd.DataFrame({"Purchase Count":item_count,
                     "Item Price":item_price,
                     "Total purchase value":item_total})
items.head()

                            Purchase Count  Item Price  Total purchase value
Item ID Item Name
0       Splinter                         4        1.28                  5.12
1       Crucifer                         3        3.26                  9.78
2       Verdict                          6        2.48                 14.88
3       Phantomlight                     6        2.49                 14.94
4       Bloodlord's Fetish               5        1.70                  8.50

In [36]:
#Total purchase value in desending order
greatest_purchase = items.sort_values("Total purchase value", ascending=False)
greatest_purchase.head()

,,Purchase Count,Item Price,Total purchase value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.23,50.76
82,Nirvana,9,4.90,44.10
145,Fiery Glass Crusader,9,4.58,41.22
92,Final Critic,8,4.88,39.04
103,Singed Scalpel,8,4.35,34.80